{"pages":[],"posts":[{"title":"","text":"","link":"/2021/11/28/cara-menulis-teks-arab-pada-libreoffice/"},{"title":"Mengatasi Gagal Memutar Video di Gnome Web &#x2F; Epiphany 3.28.6","text":"Sebagai pengguna Elementary-OS, web browser bawaan yang disuguhkan adalah Epiphany yang memiliki tampilan sangat sederhana. Hal ini sesuai dengan slogan dari Elementary OS itu sendiri. Akan tetapi, semenjak Youtube mengganti format video ke versi html5, saya tidak dapat memutar Video dari Youtube lagi. Muncul pesan bahwa browser tidak mendukung format video yang tersedia. Saya coba periksa melalui sitush HTML5Test hasilnya menampilkan browser saya mampu memutar video html5. Tapi tidak satupun video dari Youtube yang dapat diputar. Aneh kan? Setelah sekian lama mencari solusinya. Akhirnya, saya menemukan solusinya dari (https://ubuntuforums.org/showthread.php?t=2392660). Agar browser dapat memutar video, maka saya harus memasang paket-paket berikut: Code1sudo apt install gstreamer1.0-gl gstreamer1.0-libav Dan akhirnya, saya bisa memutar video di Youtube kembali.","link":"/2020/12/30/epiphany-html5-video/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/11/28/hello-world/"},{"title":"Mailmerge Menggunakan Inkscape","text":"Pada catatan kali ini, saya akan membagikan tutorial bagaimana membuat mailmerge menggunakan Inkscape. Metode ini sangat cocok diterapkan dalam pembuatan sertifikat, kartu nama, dan lain-lain. Apa saja perkakas yang diperlukan? Software yang diperlukan Inkscape Ink-generator Memasang Extension Inkscape Untuk pengguna Windows, letakkan file generator.inx dan generator.py ke dalam folder C:Program filesInkscapeshareextensions (untuk semua User) atau C:UsersApplication DataRoaminginkscapeshareextension (untuk satu User) Untuk pengguna GNU/Linux, letakkan file generator.inx dan generator.py ke dalam folder /usr/share/inkscape/extensions (untuk semua User) atau /home//.config/inkscape/extensions/ (untuk satu User) Mulai Membuat “Mailmerge” Siapkan desain kartu / sertifikat / lainnya yang hendak dibuat “mailmerge”-nya Siapkan juga tabel data yang digunakan untuk mailmerge. Untuk nama kolom usahakan jangan ada Spasi, agar tidak menimbulkan Error. contoh tabel data untuk mailmerge di inkscape Simpan ke dalam format csv. Jika mail merge yang dikehendaki membutuhkan gambar / foto. Simpan gambar-gambar / foto-foto tersebut ke dalam satu folder yang sama Buatlah teks baru untuk variabel dengan format %VAR_%. Sesuaikan dengan nama kolom di file data tadi. Misal untuk kolom nama, kita buat teks %VAR_nama% Jika menghendaki gambar, Import gambar dengan Import type Link Untuk menggunakan Ink-Generator, klik menu Extensions &gt; Export &gt; Generator Demikian tadi tutorial bagaimana membuat mailmerge menggunakan inkscape. Semoga artikel ini bisa bermanfaat","link":"/2018/05/15/inkscape-mail-merge/"},{"title":"Membuat Teks Melengkung pada Inkscape","text":"PrakataDalam mendesain stempel, logo atau lencana, sering kali kita membutuhkan teks yang melengkung / melingkar pada bagian tepinya. Ternyata, di Inkscape kita bisa melakukannya dengan sangat mudah. Kita hanya membutuhkan dua kali klik saja. Cara Membuat Teks Melengkung Bagaimanakah caranya?Untuk membuat teks melengkung di Inkscape, cukup Blok Teks dan Lingkaran, kemudian Klik Menu Text &gt; Put on Path Cukup sederhana bukan? Kita hanya perlu memilih teks dan lingkaran, bisa memilih satu per satu menggunakan Shift, atau drag menggunakan Select tool. Kemudian klik Menu Text &gt; Put on Path. Jika Iterface Inkscape Anda menggunakan bahasa Indonesia, klik Menu Teks &gt; Letak di Tapak Memutar Posisi TeksKita bisa memutar posisi teks dengan cara memutar lingkarannya. Ingat! Lingkaraannya yang kita putar, bukan Teksnya. Mengatur Ukuran Lengkung TeksKita juga bisa mengatur besar kecil ukuran lengkung teks juga dari lingkarannya. Cukup ubah ukuran lingkarannya saja. Meletakan Teks di Dalam Lingkaran Untuk teks ada di dalam lingkaran, bagaimana? Untuk meletakan teks di dalam lingkaran, cukup kita balikkan posisi teksnya secara horizontal. Menyunting TeksTeks tidak sesuai? Cukup Klik atau blok teksnya (dobel klik pada objek teks untuk masuk ke mode teks) , kita tinggal ubah jenis atau ukuran font sesuai selera. Kita juga bisa atur jarak antar huruf maupun pengaturan kerning lainnya.","link":"/2020/07/29/inkscape-teks-melengkung/"},{"title":"Fungsi Terbilang Untuk LibreOffice Calc","text":"Bagi sebagian besar pengguna Aplikasi pengolah angka Microsoft Excel, Fungsi Terbilang banyak dipergunakan di berbagai kalangan untuk membilang suatu bilangan menjadi kalimat. Khususnya bagi Anda yang hendak membuat format kwitansi, atau format nilai siswa yang menampilkan nilai angka dan nilai huruf. Namun demikian, fungsi ini bukanlah fungsi bawaan dari aplikasi pengolah angka manapun (baik Excel, Calc, maupun yang lainnya). Satu-satunya fungsi terbilang yang resmi ada di daftar formula pengolah angka hanyalah BAHTTEXT yang mengubah bilangan menjadi teks dalam bahasa Thailand beserta mata uangnya. Sehingga untuk fungsi TERBILANG dalam bahasa Indonesia maupun yang lainnya, diperlukan UDF (User Defined Function). NumberText sebagai Solusi Fungsi TerbilangPada LibreOffice Calc, Anda tidak perlu repot-repot membuat fungsi terbilang itu sendiri, karena di situs resmi LibreOffice telah disediakan extension untuk mengatasi hal tersebut. Extension yang perlu disiapkan adalah numbertext-0.9.5.oxt yang dapat diunduh di https://extensions.libreoffice.org/extensions/numbertext-1. Anda juga dapat mengunduhnya di situs resmi Numbertext http://www.numbertext.org/. Extension ini kompatible dengan versi LibreOffice 3.6 ke atas. Kelebihan dan Kekurangan NumberTextKelebihan Tidak perlu mengaktifkan Macro Formula dapat dijalankan di berbagai komputer yang menggunakan extension ini pada LibreOffice Calc / OpenOffice.org Calc. Berbeda dengan Add Ins pada Ms.Excel yang harus memperbaiki ulang rumus terbilang saat dijalankan di komputer lain. Mampu menangani bilangan hingga 15 digit (ratusan trilyun) Mampu menangani desimal hingga 15 digit Memiliki dukungan multi-bahasa. Ada 42 bahasa yang didukung dengan extension ini. Kekurangan Belum ada dukungan untuk bahasa Arab Extension ini hanya tersedia untuk LibreOffice Calc dan OpenOffice.org Calc, sehingga akan menghasilkan #NAME? saat dibuka pada aplikasi pengolah angka lainnya. InstalasiUntuk instalasi Extension tersebut, langkah-langkahnya adalah sebagai berikut: Buka file numbertext-0.9.5.oxt hingga muncul dialog konfirmasi. Klik Yes / OK Tunggu hingga proses selesai, kemudian klik Close Setelah selesai proses instalasi Extension, Restart Aplikasi LibreOffice agar agar Extension tersebut dapat dijalankan. Penggunaan FormulaTerdapat dua rumus baru pada LibreOffice Calc setelah Numbertext terpasang. Kedua rumus baru itu adalah NUMBERTEXT() dan MONEYTEXT().Untuk membilang bilangan ke dalam teks, sintaks rumusnya adalah=NUMBERTEXT(Number, Language). Sedangkan untuk membilang bilangan ke dalam teks disertai mata uang, sintaks rumusnya adalah =MONEYTEXT(Number, Currency/function, Language) Sintaks Fungsi Number bilangan yang hendak diubah Currency/function menampilkan dan mengatur tipe mata uang. Apabila dikosongi, mata uang yang ditampilkan adalah mata uang standar dari bahasa yang digunakan. Language Bahasa yang digunakan, jika dikosongi bahasa yang dihasilkan adalah bahasa default Locale Setting (lihat di menu Tools &gt; Option &gt; Language Settings ) Untuk lebih jelasnya, perhatikan contoh berikut: Formula Hasil =NUMBERTEXT(25) dua puluh lima =NUMBERTEXT(25;”th-TH”) ยี่สิบห้า =NUMBERTEXT(25,25;”en-US”) twenty-five point two five =MONEYTEXT(25) dua puluh lima rupiah =MONEYTEXT(25;”USD”) dua puluh lima dolar Amerika =MONEYTEXT(25;”CNY”;”zh-ZH”) 二十五人民币","link":"/2017/10/22/libreoffice-fungsi-terbilang/"},{"title":"Hapus Data Ganda pada LibreOffice Calc","text":"Beberapa waktu yang lalu, ada yang bertanya terkait cara hapus data duplikat / ganda pada LibreOffice Calc. Selidik punya selidik, ternyata fitur ini tidak tersedia secara native di LibreOffice. Namun, bukan berarti tidak ada cara menghapus data ganda tersebut. Pada kesempatan kali ini, kita akan bahas beberapa cara yang dapat kita lakukan untuk menangani data ganda / duplikat pada LibreOffice Calc. Ekstensi Remove DuplicateMeski fitur Remove Duplicate (hapus data ganda) belum ada secara native pada LibreOffice, tetapi ada ekstensi yang dapat kita pasang untuk melakukan hal tersebut.Kita dapat mengunduhnya pada tautan Remove Duplicates atau Remove Duplicates Fast. Keduanya mempunyai fitur dan cara kerja yang sama dengan fitur Remove Duplicates pada Ms. Excel. Instalasi EkstensiUntuk menginstal Ekstensi Remove Duplicates / Remove Duplicates Fast, langkah-langkahnya adalah sebagai berikut: Klik Meno Tools &gt; Extension Manager Klik Add, kemudian pilih File ekstensi (format .oxt) yang akan dipasang Jika muncul pesan Term &amp; Agreement, scroll ke bawah kemudian klik Accept Tunggu proses hingga selesai, kemudian restart LibreOffice PenggunaanUntuk menggunakan Ekstensi ini, langkah-langkahnya: Blok Range / Tabel yang hendak dihapus datanya Klik menu Data &gt; Remove Duplicates Tekan Ctrl+Click untuk memilih / batal memilih kolom-kolom yang dianalisa data duplikatnya Klik OK Cara AlternatifSelain menggunakan ekstensi, ada beberapa alternatif lain menghapus data duplikat pada LibreOffice Calc. Sebenarnya, ini tidak benar-benar menghapus data duplika, tetapi lebih tepat disebut sebagai memilih data unik dari data ganda yang sudah ada. Menggunakan FilterDengan menggunakan Standar Filter, kita bisa memilih data unik dan menyalinnya ke Sheet / Range lain. Caranya: Blok Range / Tabel yang hendak difilter Klik Menu Data &gt; More Filter &gt; Standar Filter Atur kolom-kolom yang hendak difilter Klik Option, centang No Duplications, dan Copy results to: Atur lokasi untuk meletakkan hasil Filter, Misal ke Sheet2$A$1 Klik OK Demikian tadi beberapa cara menghapus data ganda pada LibreOffice Calc. Semoga kedepannya fitur Remove Duplicates ini bisa ada secara native pada LibreOffice Calc.","link":"/2020/09/02/libreoffice-hapus-duplikat/"},{"title":"Mengatasi Ranking Ganda pada LibreOffice Calc","text":"Masalah Ranking GandaBeberapa waktu yang lalu, saya pernah mendapatkan pertanyaan seputar rangking ganda. Yakni bagaimana memunculkan rangking ganda, tanpa urutan terlewat. Misal terdapat rangking 3 sebanyak 3 kali, maka rangking selanjutnya adalah tetap rangking 4. Namun Jika menggunakan rumus RANK hasilnya seprti pada tabel di bawah ini: Solusi Ranking GandaNah, untuk solusi kasus di atas, dapat menggunakan kombinasi rumus SUMPRODUCT dan COUNTIF seperti berikut: =SUMPRODUCT((A2","link":"/2018/03/10/libreoffice-mengatasi-ranking-ganda/"},{"title":"Bahas-Soal-Matematika-#1","text":"ProblemBuktikan bahwa [\\frac{a+b}{2}\\ge\\sqrt{ab}] SolusiUntuk setiap bilangan real (a,b), berlaku [(a-b)^2\\ge0]","link":"/2021/11/28/matematika-bahas-soal-1/"},{"title":"Mengompres filw PDF di Linux","text":"Mengompres file PDF menggunakan Terminal (Konsol) LinuxMenggunakan GhostscriptMenggunakan ps2pdfMengompres file PDF menggunakan GUIMenggunakan Density","link":"/2021/04/05/pdf-kompres-linux/"}],"tags":[{"name":"matematika","slug":"matematika","link":"/tags/matematika/"},{"name":"epiphany","slug":"epiphany","link":"/tags/epiphany/"},{"name":"html5 video","slug":"html5-video","link":"/tags/html5-video/"},{"name":"inkscape generator","slug":"inkscape-generator","link":"/tags/inkscape-generator/"},{"name":"mail merge","slug":"mail-merge","link":"/tags/mail-merge/"},{"name":"inkscape","slug":"inkscape","link":"/tags/inkscape/"},{"name":"text effect","slug":"text-effect","link":"/tags/text-effect/"},{"name":"stamp","slug":"stamp","link":"/tags/stamp/"},{"name":"Calc","slug":"Calc","link":"/tags/Calc/"},{"name":"Extension","slug":"Extension","link":"/tags/Extension/"},{"name":"LibreOffice","slug":"LibreOffice","link":"/tags/LibreOffice/"},{"name":"Office","slug":"Office","link":"/tags/Office/"},{"name":"libreoffice","slug":"libreoffice","link":"/tags/libreoffice/"},{"name":"calc","slug":"calc","link":"/tags/calc/"},{"name":"remove duplicate","slug":"remove-duplicate","link":"/tags/remove-duplicate/"},{"name":"hapus ganda","slug":"hapus-ganda","link":"/tags/hapus-ganda/"},{"name":"Function","slug":"Function","link":"/tags/Function/"},{"name":"problem","slug":"problem","link":"/tags/problem/"},{"name":"compress pdf","slug":"compress-pdf","link":"/tags/compress-pdf/"},{"name":"ps2pdf","slug":"ps2pdf","link":"/tags/ps2pdf/"},{"name":"gs","slug":"gs","link":"/tags/gs/"}],"categories":[{"name":"Tips","slug":"Tips","link":"/categories/Tips/"},{"name":"Tutorial","slug":"Tutorial","link":"/categories/Tutorial/"},{"name":"Web","slug":"Tips/Web","link":"/categories/Tips/Web/"},{"name":"Matematika","slug":"Matematika","link":"/categories/Matematika/"},{"name":"Inkscape","slug":"Tutorial/Inkscape","link":"/categories/Tutorial/Inkscape/"},{"name":"PDF","slug":"Tutorial/PDF","link":"/categories/Tutorial/PDF/"},{"name":"LibreOffice","slug":"Tutorial/LibreOffice","link":"/categories/Tutorial/LibreOffice/"},{"name":"Problem","slug":"Matematika/Problem","link":"/categories/Matematika/Problem/"},{"name":"Calc","slug":"Tutorial/LibreOffice/Calc","link":"/categories/Tutorial/LibreOffice/Calc/"}]}